espressif/esp-serial-flasher/examples/esp32_runtime_interface_switching_example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_SERIAL_FLASHER_PORT_SDIO=y
CONFIG_SERIAL_FLASHER_PORT_UART=y
CONFIG_SERIAL_FLASHER_PORT_USB_CDC_ACM=y
